Diplom/src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <registerRecords>AccumulationRegister.ВКМ_ГрафикОтпусков</registerRecords>
  <attributes>
    <name>Год</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтпускаСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ВКМ_ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДнейВОтпуске</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Diplom/src/Documents/ВКМ_ГрафикОтпусков/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийЭлементовТаблицыФормыОтпускаСотрудников

&НаКлиенте
Процедура ОтпускаСотрудниковДатаНачалаПриИзменении(Элемент)
	
	РассчитатьКоличествоДнейВОтпуске()
	
КонецПроцедуры

&НаКлиенте
Процедура ОтпускаСотрудниковДатаОкончанияПриИзменении(Элемент)
	
	РассчитатьКоличествоДнейВОтпуске() 
	
КонецПроцедуры

&НаКлиенте
Процедура ОтпускаСотрудниковСотрудникПриИзменении1(Элемент)
	
	РассчитатьКоличествоДнейВОтпуске() 
	
КонецПроцедуры


#КонецОбласти


#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура ОткрытьАнализГрафика(Команда) 
	
	Адрес = ОткрытьАнализГрафикаНаСервере();
	
	Если ЗначениеЗаполнено(Объект.Год) Тогда   
		
		СтруктураПараметры = Новый Структура("АдресХранилища, Год", Адрес, Объект.Год); 
		
	Иначе ОбщегоНазначенияКлиент.СообщитьПользователю("Не выбран год отпусков");   
		
	КонецЕсли;  
	
	ОткрытьФорму("Документ.ВКМ_ГрафикОтпусков.Форма.ФормаАнализГрафика", СтруктураПараметры);	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура РассчитатьКоличествоДнейВОтпуске() 
	
	ТекущиеДанные = Элементы.ОтпускаСотрудников.ТекущиеДанные; 
	
	ТекущиеДанные.ДнейВОтпуске = ДеньГода(ТекущиеДанные.ДатаОкончания) - ДеньГода(ТекущиеДанные.ДатаНачала);
	
КонецПроцедуры

&НаСервере
Функция ОткрытьАнализГрафикаНаСервере()
	Возврат ПоместитьВоВременноеХранилище(Объект.ОтпускаСотрудников.Выгрузить());
КонецФункции

#КонецОбласти
